In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data2.csv")

In [3]:
df

  Google           27.43   67   893     Larry Page
0    WMT            4.62  453    65           n.a.
1   MSFT              01   34    56     bill gates
2    RIL   not available   50  1234  mukesh ambani
3   TATA             4.5   -1  n.a.     ratan tata

In [4]:
df = pd.read_csv("data2.csv",header=None)

In [5]:
df

        0               1    2     3              4
0  Google           27.43   67   893     Larry Page
1     WMT            4.62  453    65           n.a.
2    MSFT              01   34    56     bill gates
3     RIL   not available   50  1234  mukesh ambani
4    TATA             4.5   -1  n.a.     ratan tata

In [6]:
df = pd.read_csv("data2.csv",header=None,names=['company','net growth','net worth','share price','founder'])

In [7]:
df

  company      net growth  net worth share price        founder
0  Google           27.43         67         893     Larry Page
1     WMT            4.62        453          65           n.a.
2    MSFT              01         34          56     bill gates
3     RIL   not available         50        1234  mukesh ambani
4    TATA             4.5         -1        n.a.     ratan tata